window.blogContent = {
  site: {
    title: "Aertly",
    author: "Aertly"
  },


  posts: [
    {
      // 文章唯一标识
      // 会用于详情页链接：post.html?slug=night-train-letter
      slug: "night-train-letter",
      // 文章标题
      title: "施工中",
      // 文章分类
      category: "施工中",
      // 日期
      date: "2026-03-18",
      // 阅读时长
      readTime: "5 min",
      // 列表页摘要
      summary: "施工中",
      // 列表封面（可选）：填图床 URL 或相对路径
      // cover: "https://your-image-host.com/post-cover.jpg",
      // 封面描述（可选）
      // coverAlt: "夜行列车的窗外",
      // 标签数组
      // 可自由增删，用于显示关键词
      tags: ["施工中", "施工中", "施工中"],
      // 详情页标题上方的小标题
      kicker: "施工中",
      // 详情页标题下方的引言
      intro: "施工中",
      // 正文分节数组
      // 每个 section 会渲染成一个小节
      sections: [
        {
          // 小节标题
          heading: "施工中",
          // 段落数组
          // 每一项都会渲染成一段正文
          // 现在支持图片语法：![图片说明](图片URL或相对路径)
          // 例如：![实验波形图](./images/wave-01.png)
          paragraphs: [
            "施工中",
            "施工中"
          ]
        },
        {
          // 小节标题
          heading: "施工中",
          // 段落数组
          paragraphs: [
            "施工中",
            "施工中"
          ]
        }
      ]
    }
  ],



  projects: [
    {
      slug: "electrical-machine",
      // 笔记标题
      title: "电机学",
      // 当前状态，比如：施工中 / 连载中 / 完结
      status: "更新中",
      // 年份
      year: "2026",
      // 列表摘要
      description: "记录电机学学习过程中的笔记与若干总结",
      // 列表封面（可选）：填图床 URL 或相对路径
      cover: "https://free.boltp.com/2026/04/28/69f06dd22ce74.webp",
      detail: "2026春季学期",
      // 详情页标题上方的小标题
      kicker: "时间与空间的耦合",
      // 详情页引言
      intro: "《电机学》作为电机系难度较大的课程之一，为了加深对课程的理解，于此处进行一些整理",
      // 正文分节数组
      sections: [
        {
          heading: "绕组、电动势与磁动势",
          paragraphs: [
            "不管是同步电机还是异步电机，都具有相似的定子与转子结构结构，二者最大的差别在于其绕组以及绕组的通电方式。"+
            "从电动势与磁动势的角度来分析时可以遵循一套相同的方法。即电机中的电动势均可以认为来自于旋转的磁动势。",
            "考虑一极对数为p的，转子以转速n(转/min)逆时针转动，定子为三相对称绕组的电机，我们将分为若干种情况进行分析，接下来的分析默认旋转磁动势的"+
            "正方向为逆时针，且仅仅考虑磁动势基波分量，谐波情况下只要注意极对数的变化即可。",
            "——————————",
            "转子励磁绕组通入直流电流，定子未通电流。这是一种很简单的情况，励磁绕组由于转子的旋转产生正转磁动势，且此磁动势转速为n,记为:"+
            "$$F_1=cos(\\alpha - \\omega_1 t + \\phi_1)$$，其中$$\\omega_1=\\frac{p \\cdot n\\pi}{30}$$定子绕组因此产生响应的感应电动势，其频率为:$$f_1=\\frac{\\omega}{2\\pi}$$"+
            "定子绕组感应电流可记为:$$i_a=I_a cos(\\omega t - \\alpha +\\phi_i)$$简单分析可知，定子绕组又会产生一个正转的磁动势，且转速与转子相等，因此不会在励磁绕组中"+
            "产生感应电动势，我们的分析就到此为止，这也是这种情况简单的原因所在。",
            "——————————",
            "接下来考虑一种更加复杂的情况，定子绕组通入对称三相电流，频率为$f_2$;励磁绕组仍然通入直流电，转子仍然以转速n逆时针旋转"+
            "首先转子旋转产生了正转磁动势$F_1$,该磁动势在定子绕组中感应出频率为$f_1$的三相对称电流，此频率成分基波虽然产生了旋转的磁动势，但由于"+
            "与转子保持相对静止，并未对励磁绕组产生影响；对于$f_2$频率成分则不然，该成分产生磁动势表达式为：$$F_2=cos(\\alpha - \\omega_2 t + \\phi_2)$$"+
            "其转速$$n_2=\\frac{60 f_2}{p}$$在励磁绕组中产生感应电流频率为$$f_{b1}=\\frac{|n_1-n_2| p}{60}$$若$n_1=n_2$，则分析结束，已经确认了所有频率分量，"+
            "否则继续迭代分析此励磁绕组感应电流的影响，设此感应电流的频率为$f_3$，即在电流交变的同时还有空间上的旋转；在转子参考系中将脉振磁动势分解为正转反转的两个分量，记转速为$n_3$"+
            "计算方式同上。将其分别映射到定子参考系，因此磁动势正转速度为$n_3+n_1$，反转速度为$n_3-n_1$，分别在定子绕组中继续感应出电流。",
            "如此循环，直至分析出定子绕组与转子绕组中的全部频率分量。"
          ]
        }
      ]
    }
  ],

  about: {
    motto: "まことに人生、一瞬の夢、ゴム風船の、美しさかな。",
    nickname: "Aertly",
    friendLinks: [
      { label: "Bangumi", url: "https://bgm.tv/user/aertly" },
      { label: "Bilibili", url: "https://space.bilibili.com/267637114" }
    ],
    introTitle: "这里是 Aertly。",
    introParagraphs: [
      "欢迎来到我的小站",
      "或许会在这里更新一些笔记或是对作品的感受与评价"
    ],
    basicTitle: "关于我",
    basicParagraphs: [
      "普通在读学生"
    ],
    hobbiesTitle: "标签",
    favorites: ["animation","galgame","EE","jrpg"]
  }
};
