window.blogContent = {
  site: {
    title: "Aertly",
    author: "Aertly"
  },


  posts: [
    {
      // 文章唯一标识
      // 会用于详情页链接：post.html?slug=night-train-letter
      slug: "Sufferings_such_as_misfortune",
      // 文章标题
      title: "不幸之类的苦痛",
      // 文章分类
      category: "杂记",
      // 日期
      date: "2026-05-13",
      // 阅读时长
      readTime: "3 min",
      // 列表页摘要
      summary: "写在痛苦之后幸福之前",
      // 列表封面（可选）：填图床 URL 或相对路径
      cover: "https://img.cdn1.vip/i/6a042a6764a33_1778657895.jpg",
      tags: [],
      // 详情页标题上方的小标题
      kicker: "写在痛苦之后幸福之前",
      // 详情页标题下方的引言
      // 正文分节数组
      // 每个 section 会渲染成一个小节
      sections: [
        {
          // 段落数组
          // 每一项都会渲染成一段正文
          // 现在支持图片语法：![图片说明](图片URL或相对路径)
          // 例如：![实验波形图](./images/wave-01.png)
          heading:"",
          paragraphs: [
            "过去这一年，我无数次回想起那个阴冷的雨天 。其实我已经记不清那天是否真的下了雨，或许只是为了让记忆更鲜亮，我不自觉地给它贴上了这个标签。殡仪馆中心，人群鞠着躬换了一批又一批，那里静静躺着一具躯体。这便是我记忆中的死亡，一个人的终点 。",
            "总是抑制不住地去设想他所相信的世界的终点；在迎来死亡之际，他到底是清醒还是早已昏厥，如果清醒的话，是否又意识到了自己的思考将要消散，是否接受了将要死亡的事实呢？这些全部都无从得知，死亡这个词就如同其字面意思那样残酷，思念或是言语，一切都没有办法传达。如果一无所知地死去，或许也是一种幸福吧；然而更大的可能则是他意识到了自己的死亡并感到不甘心，毕竟是这样认真去活着的人，自己遗失在某处的梦想还没有实现，又怎么可能接受这种荒唐的终点。听说他事发当天上午还能去河边劳作，却在午饭时一头倒在了地上，直到下午才被回到家中的婶婶发现早已没了呼吸。总是照顾别人，结果自己却在无人看护中离去，这样残酷的事情居然是被允许的吗。",
            "刚刚装修完工的商品房，自己拼接的即将竣工的鱼缸，以及偶尔买来犒劳自己的散酒，一切无不昭示着理所当然的幸福正在不远处等待着自己，可没有人能想到就连这样短的距离也无法抵达。葬礼的那天晚上，我注视了遗像一整晚，期待着能从定格的表情中读出他的想法，当然这并没有什么用，不过是空洞的内心导致的失眠，或许就连现在我也活在这种恍惚感之中，真正的我也在那一天死掉了。",
            "“所爱之人死去之时，我必须自杀”，终于理解了中原中野在《春日狂想》中写下的这句话，面对亲人的离世，首先要杀死过去的自己，杀死一无所知的自己，杀死将幸福当作理所当然的自己。现在回想起与他有关的日常才明白这或许是我人生中最幸福的一段时光，无数至高的瞬间点缀其中；可当时并没有察觉，认为这很普通。为什么没能察觉到呢？因为周围的一切，甚至我自己都在闪闪发光，刺得人睁不开眼睛，无法正视此刻的幸福。",
            "可现在呢，一切都黯然失色，我自己也是，幸福并没有存在此处，有的仅仅只是痛苦，可是却比任何时候都要有脚踏实地的感觉。大概只有幸福的人才会感到痛苦吧，真正不幸的人不可能有这种感受；正是因为不是一无是处，正是因为还能走下去，正是因为在向着某种东西反抗才会感到痛苦。不幸之类的苦痛，或许就在幸福的背面，两者是一体的。",
            "我像是一个猛然惊醒的人，从床上醒来发现自己没有过去的记忆，有的只是一片空白，像是被投放到陌生世界的婴儿，全身上下都是不成熟的地方。也正因如此，我在有意与无意间做了许多可笑的事情。不过这些都无关紧要了，我终于下定了决心，尽管我无从得知逝者的想法，尽管不知道我能做到哪一步，我都要让三叔在我的记忆里长存，然后，代替他去做他没能做完的事。",
            "像是乐章中跌宕起伏的音符一般，在幸福与痛苦的交织间，挣扎着向前走，我应该是正确的吧。"
          ]
        }
      ]
    }
  ],



  projects: [
    {
      slug: "electrical-machine",
      // 笔记标题
      title: "电机学",
      // 当前状态，比如：施工中 / 连载中 / 完结
      status: "更新中",
      // 年份
      year: "2026",
      // 列表摘要
      description: "记录电机学学习过程中的笔记与若干总结",
      // 列表封面（可选）：填图床 URL 或相对路径
      cover: "https://img.cdn1.vip/i/6a143592a2f64_1779709330.webp",
      detail: "2026春季学期",
      // 详情页标题上方的小标题
      kicker: "时间与空间的耦合",
      // 详情页引言
      intro: "《电机学》作为电机系难度较大的课程之一，为了加深对课程的理解，于此处进行一些整理",
      // 正文分节数组
      sections: [
        {
          heading: "绕组中感应电流频率成分的分析",
          paragraphs: [
            "不管是同步电机还是异步电机，都具有相似的定子与转子结构结构，二者最大的差别在于其绕组以及绕组的通电方式。"+
            "从电动势与磁动势的角度来分析时可以遵循一套相同的方法。即电机中的电动势均可以认为来自于旋转的磁动势。",
            "考虑一极对数为p的，转子以转速n(转/min)逆时针转动，定子为三相对称绕组的电机，我们将分为若干种情况进行分析，接下来的分析默认旋转磁动势的"+
            "正方向为逆时针，且仅仅考虑磁动势基波分量，谐波情况下只要注意极对数的变化即可。",
            "——————————",
            "转子励磁绕组通入直流电流，定子未通电流。这是一种很简单的情况，励磁绕组由于转子的旋转产生正转磁动势，且此磁动势转速为n,记为:"+
            "$$F_1=cos(\\alpha - \\omega_1 t + \\phi_1)$$，其中$$\\omega_1=\\frac{p \\cdot n\\pi}{30}$$定子绕组因此产生响应的感应电动势，其频率为:$$f_1=\\frac{\\omega}{2\\pi}$$"+
            "定子绕组感应电流可记为:$$i_a=I_a cos(\\omega t - \\alpha +\\phi_i)$$简单分析可知，定子绕组又会产生一个正转的磁动势，且转速与转子相等，因此不会在励磁绕组中"+
            "产生感应电动势，我们的分析就到此为止，这也是这种情况简单的原因所在。",
            "——————————",
            "接下来考虑一种更加复杂的情况，定子绕组通入对称三相电流，频率为$f_2$;励磁绕组仍然通入直流电，转子仍然以转速n逆时针旋转"+
            "首先转子旋转产生了正转磁动势$F_1$,该磁动势在定子绕组中感应出频率为$f_1$的三相对称电流，此频率成分基波虽然产生了旋转的磁动势，但由于"+
            "与转子保持相对静止，并未对励磁绕组产生影响；对于$f_2$频率成分则不然，该成分产生磁动势表达式为：$$F_2=cos(\\alpha - \\omega_2 t + \\phi_2)$$"+
            "其转速$$n_2=\\frac{60 f_2}{p}$$在励磁绕组中产生感应电流频率为$$f_{b1}=\\frac{|n_1-n_2| p}{60}$$若$n_1=n_2$，则分析结束，已经确认了所有频率分量，"+
            "否则继续迭代分析此励磁绕组感应电流的影响，设此感应电流的频率为$f_3$，即在电流交变的同时还有空间上的旋转；在转子参考系中将脉振磁动势分解为正转反转的两个分量，记转速为$n_3$"+
            "计算方式同上。将其分别映射到定子参考系，因此磁动势正转速度为$n_3+n_1$，反转速度为$n_3-n_1$，分别在定子绕组中继续感应出电流。",
            "如此循环，直至分析出定子绕组与转子绕组中的全部频率分量。"
          ]
        },
        {
          heading:"同步电机运行分析",
          paragraphs: [
            "同步电机主要分为凸极同步电机与隐极同步电机，二者的差异在于气隙是否均匀，在分析时存在一些差别这里可以在下面看到。由于同步电机电枢绕组开路可以视为其运行的一种简单情况，因此主要分析一般情况下的运行。",
            "关于同步电机的原理，首先是转子通入励磁电流$I_f$形成旋转的磁动势$F_{f1}$,进而产生气隙磁场，气隙磁场在定子绕组中通过电磁感应获得感应电流。需要补充的是，气隙磁场是由$F_{f1}$与定子绕组电流产生的旋转磁动势（记为$F_a$）共同作用产生的，此磁动势产生的过程叫做电枢反应"
            +"在时空相矢量图中，根据$F_{f1}$与$F_a$相对位置的不同，电枢反应被分为直轴与交轴。旋转的气隙磁场在定子绕组感应出电动势，对应关系为：$$E = 4.44 f N_1 k_{dp1} \\Phi_m$$",
            "首先分析隐极同步电机，在忽略磁滞与涡流损耗的情况下，磁动势与其对应的磁场在空间上同相位，从磁路角度来看，认为磁动势主要消耗在气隙上，数量关系表现为下式：$$B=\\frac{\\mu_0 F}{\\delta}$$"+
            "其中$\\delta$为气隙长度。隐极同步电机的分析又分为饱和以及不饱和的情形，具体体现在磁路是否可以视作线性。"













          ]
        }
      ]
    }
  ],

  about: {
    motto: "まことに人生、一瞬の夢、ゴム風船の、美しさかな。",
    nickname: "Aertly",
    friendLinks: [
      { label: "Bangumi", url: "https://bgm.tv/user/aertly" },
      { label: "Bilibili", url: "https://space.bilibili.com/267637114" },
      { label: "Steam", url: "https://steamcommunity.com/id/aertly/"}
    ],
    introTitle: "这里是 Aertly。",
    introParagraphs: [
      "欢迎来到我的小站",
      "或许会在这里更新一些笔记或是对作品的感受与评价"
    ],
    basicTitle: "关于我",
    basicParagraphs: [
      "普通在读学生"
    ],
    hobbiesTitle: "探索中...",
    favorites: ["animation","galgame","EE","jrpg"]
  }
};
